index.org
#+Title: foo

* thingk
** delay, moleskin first
** single page
* env
** lang
*** korean
*** english
*** russian
- about read!
*** french
- about read?
*** deutsch
*** why?
** history
*** global
*** national
*** universal
*** why?
* human
** body
*** part
** cook
** work
** walk
* book
** walden type
** long but interesting
** vs poetry
** vs cinema
** or more
* writing
** poem, poetry, poet
** on slideshare
* editor > emacs or mode

- list-package

** (eshell ls)
** (org org-export-dispatch)
** slime
** tramp
** ace-swap-window
