index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>foo</title>
<!-- 2016-03-31 목 18:29 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">foo</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. thingk</a>
<ul>
<li><a href="#sec-1-1">1.1. delay, moleskin first</a></li>
<li><a href="#sec-1-2">1.2. single page</a></li>
</ul>
</li>
<li><a href="#sec-2">2. env</a>
<ul>
<li><a href="#sec-2-1">2.1. lang</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. korean</a></li>
<li><a href="#sec-2-1-2">2.1.2. english</a></li>
<li><a href="#sec-2-1-3">2.1.3. russian</a></li>
<li><a href="#sec-2-1-4">2.1.4. french</a></li>
<li><a href="#sec-2-1-5">2.1.5. deutsch</a></li>
<li><a href="#sec-2-1-6">2.1.6. why?</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. history</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. global</a></li>
<li><a href="#sec-2-2-2">2.2.2. national</a></li>
<li><a href="#sec-2-2-3">2.2.3. universal</a></li>
<li><a href="#sec-2-2-4">2.2.4. why?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. human</a>
<ul>
<li><a href="#sec-3-1">3.1. body</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. part</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2. cook</a></li>
<li><a href="#sec-3-3">3.3. work</a></li>
<li><a href="#sec-3-4">3.4. walk</a></li>
</ul>
</li>
<li><a href="#sec-4">4. book</a>
<ul>
<li><a href="#sec-4-1">4.1. walden type</a></li>
<li><a href="#sec-4-2">4.2. long but interesting</a></li>
<li><a href="#sec-4-3">4.3. vs poetry</a></li>
<li><a href="#sec-4-4">4.4. vs cinema</a></li>
<li><a href="#sec-4-5">4.5. or more</a></li>
</ul>
</li>
<li><a href="#sec-5">5. writing</a>
<ul>
<li><a href="#sec-5-1">5.1. poem, poetry, poet</a></li>
<li><a href="#sec-5-2">5.2. on slideshare</a></li>
</ul>
</li>
<li><a href="#sec-6">6. editor &gt; emacs or mode</a>
<ul>
<li><a href="#sec-6-1">6.1. (eshell ls)</a></li>
<li><a href="#sec-6-2">6.2. (org org-export-dispatch)</a></li>
<li><a href="#sec-6-3">6.3. slime</a></li>
<li><a href="#sec-6-4">6.4. tramp</a></li>
<li><a href="#sec-6-5">6.5. ace-swap-window</a></li>
<li><a href="#sec-6-6">6.6. one more on emacs</a>
<ul>
<li><a href="#sec-6-6-1">6.6.1. remove CR</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-7">7. hardware</a>
<ul>
<li><a href="#sec-7-1">7.1. serial</a></li>
<li><a href="#sec-7-2">7.2. modem</a></li>
<li><a href="#sec-7-3">7.3. usb</a>
<ul>
<li><a href="#sec-7-3-1">7.3.1. usb2serial</a></li>
<li><a href="#sec-7-3-2">7.3.2. host</a></li>
<li><a href="#sec-7-3-3">7.3.3. nic</a></li>
</ul>
</li>
<li><a href="#sec-7-4">7.4. bios?</a></li>
<li><a href="#sec-7-5">7.5. memory</a></li>
<li><a href="#sec-7-6">7.6. cpu</a></li>
<li><a href="#sec-7-7">7.7. disk, storage</a></li>
</ul>
</li>
<li><a href="#sec-8">8. programming</a>
<ul>
<li><a href="#sec-8-1">8.1. lisp on emacs or clisp</a>
<ul>
<li><a href="#sec-8-1-1">8.1.1. list</a></li>
<li><a href="#sec-8-1-2">8.1.2. when?</a></li>
<li><a href="#sec-8-1-3">8.1.3. sample</a></li>
</ul>
</li>
<li><a href="#sec-8-2">8.2. perl or shell script(bash or more)</a>
<ul>
<li><a href="#sec-8-2-1">8.2.1. string</a></li>
<li><a href="#sec-8-2-2">8.2.2. cpan</a></li>
<li><a href="#sec-8-2-3">8.2.3. sample</a></li>
</ul>
</li>
<li><a href="#sec-8-3">8.3. what else?</a>
<ul>
<li><a href="#sec-8-3-1">8.3.1. powershell</a></li>
<li><a href="#sec-8-3-2">8.3.2. ruby</a></li>
</ul>
</li>
<li><a href="#sec-8-4">8.4. for what?</a></li>
</ul>
</li>
<li><a href="#sec-9">9. security</a>
<ul>
<li><a href="#sec-9-1">9.1. layer</a>
<ul>
<li><a href="#sec-9-1-1">9.1.1. tree</a></li>
<li><a href="#sec-9-1-2">9.1.2. leaf</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-10">10. operating system</a>
<ul>
<li><a href="#sec-10-1">10.1. kinds of</a>
<ul>
<li><a href="#sec-10-1-1">10.1.1. linux</a></li>
<li><a href="#sec-10-1-2">10.1.2. kali</a></li>
<li><a href="#sec-10-1-3">10.1.3. debian</a></li>
<li><a href="#sec-10-1-4">10.1.4. android</a></li>
<li><a href="#sec-10-1-5">10.1.5. registry</a></li>
<li><a href="#sec-10-1-6">10.1.6. windows</a></li>
</ul>
</li>
<li><a href="#sec-10-2">10.2. deep</a>
<ul>
<li><a href="#sec-10-2-1">10.2.1. process</a></li>
<li><a href="#sec-10-2-2">10.2.2. file system</a></li>
</ul>
</li>
<li><a href="#sec-10-3">10.3. lots of</a>
<ul>
<li><a href="#sec-10-3-1">10.3.1. capistrano</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-11">11. shell</a>
<ul>
<li><a href="#sec-11-1">11.1. t-shell</a>
<ul>
<li><a href="#sec-11-1-1">11.1.1. semi agent</a></li>
</ul>
</li>
<li><a href="#sec-11-2">11.2. agent</a>
<ul>
<li><a href="#sec-11-2-1">11.2.1. do as what x do? or did? or will do as what y want!</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-12">12. infra</a>
<ul>
<li><a href="#sec-12-1">12.1. email fly</a></li>
<li><a href="#sec-12-2">12.2. proxy</a></li>
<li><a href="#sec-12-3">12.3. spof</a></li>
<li><a href="#sec-12-4">12.4. tree</a></li>
<li><a href="#sec-12-5">12.5. amazon</a>
<ul>
<li><a href="#sec-12-5-1">12.5.1. ec2</a></li>
</ul>
</li>
<li><a href="#sec-12-6">12.6. monitoring, knowing</a>
<ul>
<li><a href="#sec-12-6-1">12.6.1. nagios</a></li>
<li><a href="#sec-12-6-2">12.6.2. mon</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-13">13. malware</a>
<ul>
<li><a href="#sec-13-1">13.1. pentesting tool</a></li>
<li><a href="#sec-13-2">13.2. exploit kit</a>
<ul>
<li><a href="#sec-13-2-1">13.2.1. Angler</a></li>
<li><a href="#sec-13-2-2">13.2.2. Neutrino</a></li>
</ul>
</li>
<li><a href="#sec-13-3">13.3. <span class="done DONE">DONE</span> ransomware</a>
<ul>
<li><a href="#sec-13-3-1">13.3.1. Locky</a></li>
<li><a href="#sec-13-3-2">13.3.2. TeslaCrypt 3.0</a></li>
<li><a href="#sec-13-3-3">13.3.3. CryptoWall</a></li>
<li><a href="#sec-13-3-4">13.3.4. Linux.Encoder.1 / Dr. Web</a></li>
<li><a href="#sec-13-3-5">13.3.5. dig</a></li>
</ul>
</li>
<li><a href="#sec-13-4">13.4. windows script host, wsh, jscript, vbs</a></li>
<li><a href="#sec-13-5">13.5. policy, whilte</a></li>
<li><a href="#sec-13-6">13.6. vaccine</a>
<ul>
<li><a href="#sec-13-6-1">13.6.1. v3</a></li>
<li><a href="#sec-13-6-2">13.6.2. Windows Defender for Windows 10 and Windows 8.1</a></li>
<li><a href="#sec-13-6-3">13.6.3. Microsoft Security Essentials for Windows7 and Windows Vista</a></li>
<li><a href="#sec-13-6-4">13.6.4. Microsoft Safety Scanner, just one time</a></li>
</ul>
</li>
<li><a href="#sec-13-7">13.7. defense</a>
<ul>
<li><a href="#sec-13-7-1">13.7.1. Shadow Volume Copies then ShadowExplorer</a></li>
<li><a href="#sec-13-7-2">13.7.2. Backup</a></li>
<li><a href="#sec-13-7-3">13.7.3. inotify</a></li>
</ul>
</li>
<li><a href="#sec-13-8">13.8. packer, unpacker, compressor, obfuscation</a></li>
<li><a href="#sec-13-9">13.9. tool</a>
<ul>
<li><a href="#sec-13-9-1">13.9.1. gmer</a></li>
<li><a href="#sec-13-9-2">13.9.2. pestudio</a></li>
<li><a href="#sec-13-9-3">13.9.3. virustotal</a></li>
<li><a href="#sec-13-9-4">13.9.4. officecat</a></li>
<li><a href="#sec-13-9-5">13.9.5. offvis</a></li>
<li><a href="#sec-13-9-6">13.9.6. </a></li>
<li><a href="#sec-13-9-7">13.9.7. sigcheck -v</a></li>
<li><a href="#sec-13-9-8">13.9.8. sysinternals</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-14">14. memo</a>
<ul>
<li><a href="#sec-14-1">14.1. moleskine</a></li>
<li><a href="#sec-14-2">14.2. share</a></li>
</ul>
</li>
<li><a href="#sec-15">15. cinema</a>
<ul>
<li><a href="#sec-15-1">15.1. why?</a></li>
<li><a href="#sec-15-2">15.2. list and lots of</a></li>
</ul>
</li>
<li><a href="#sec-16">16. compute</a>
<ul>
<li><a href="#sec-16-1">16.1. not computer</a></li>
<li><a href="#sec-16-2">16.2. robot</a></li>
<li><a href="#sec-16-3">16.3. HAL, 2001</a></li>
</ul>
</li>
<li><a href="#sec-17">17. key tech</a>
<ul>
<li><a href="#sec-17-1">17.1. for free, for free</a></li>
<li><a href="#sec-17-2">17.2. for money</a>
<ul>
<li><a href="#sec-17-2-1">17.2.1. ransomware, cryptoware</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-18">18. network</a>
<ul>
<li><a href="#sec-18-1">18.1. router</a>
<ul>
<li><a href="#sec-18-1-1">18.1.1. BGP</a></li>
</ul>
</li>
<li><a href="#sec-18-2">18.2. switch</a></li>
<li><a href="#sec-18-3">18.3. trunk, etherchannel, bonding</a></li>
</ul>
</li>
<li><a href="#sec-19">19. versioning</a>
<ul>
<li><a href="#sec-19-1">19.1. git</a>
<ul>
<li><a href="#sec-19-1-1">19.1.1. github</a></li>
</ul>
</li>
<li><a href="#sec-19-2">19.2. svn, cvs</a></li>
</ul>
</li>
<li><a href="#sec-20">20. configration management</a>
<ul>
<li>
<ul>
<li><a href="#sec-20-0-1">20.0.1. puppet</a></li>
<li><a href="#sec-20-0-2">20.0.2. cfengine</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-21">21. reversing</a>
<ul>
<li>
<ul>
<li><a href="#sec-21-0-1">21.0.1. reversing.kr</a></li>
<li><a href="#sec-21-0-2">21.0.2. ALZ</a></li>
<li><a href="#sec-21-0-3">21.0.3. vs locky ransomware</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-22">22. robot</a></li>
<li><a href="#sec-23">23. up2date</a></li>
<li><a href="#sec-24">24. backup</a></li>
<li><a href="#sec-25">25. digital forensics</a>
<ul>
<li>
<ul>
<li><a href="#sec-25-0-1">25.0.1. ls -ltr</a></li>
<li><a href="#sec-25-0-2">25.0.2. FTK</a></li>
<li><a href="#sec-25-0-3">25.0.3. lots of more</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-26">26. v3 Process Listing</a>
<ul>
<li>
<ul>
<li><a href="#sec-26-0-1">26.0.1. Pure V3 Process List</a></li>
<li><a href="#sec-26-0-2">26.0.2. PA Based V3 Process list</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-27">27. ipv6</a></li>
<li><a href="#sec-28">28. one more thing but not just one</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> thingk</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> delay, moleskin first</h3>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> single page</h3>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> env</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> lang</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> korean</h4>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> english</h4>
</div>
<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> russian</h4>
<div class="outline-text-4" id="text-2-1-3">
<ul class="org-ul">
<li>about read!
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> french</h4>
<div class="outline-text-4" id="text-2-1-4">
<ul class="org-ul">
<li>about read?
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-1-5" class="outline-4">
<h4 id="sec-2-1-5"><span class="section-number-4">2.1.5</span> deutsch</h4>
</div>
<div id="outline-container-sec-2-1-6" class="outline-4">
<h4 id="sec-2-1-6"><span class="section-number-4">2.1.6</span> why?</h4>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> history</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> global</h4>
</div>
<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> national</h4>
</div>
<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> universal</h4>
</div>
<div id="outline-container-sec-2-2-4" class="outline-4">
<h4 id="sec-2-2-4"><span class="section-number-4">2.2.4</span> why?</h4>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> human</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> body</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> part</h4>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> cook</h3>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> work</h3>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> walk</h3>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> book</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> walden type</h3>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> long but interesting</h3>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> vs poetry</h3>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> vs cinema</h3>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> or more</h3>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> writing</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> poem, poetry, poet</h3>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> on slideshare</h3>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> editor &gt; emacs or mode</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>list-package
</li>
</ul>
</div>

<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> (eshell ls)</h3>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> (org org-export-dispatch)</h3>
</div>
