index.org
** one more on emacs
*** remove CR

- M-x delete-trailing-whitespace

* hardware
** serial
** modem
** usb
*** usb2serial
*** host
*** nic
**** rndis
**** CDC-ECM
** bios?
** memory
** cpu
** disk, storage
* programming
** lisp on emacs or clisp
*** list
*** when?
*** sample
#+BEGIN_SRC

(cons t nil)
(if 1 2 3)
(when 1 2 3)
(cond (1 2) (3 4))
(loop for i from 1 to 10 collect i)
(defun foo () (format t "this is foo"))
(random 10)

#+END_SRC
** perl or shell script(bash or more)
*** string
*** cpan
*** sample
#+BEGIN_SRC

foreach $line (<>) {
  $line ~= s/\r//g;
  $line ~= s/\n//g;
  print $line . "\n";q
}

#+END_SRC
** what else?
*** powershell
**** sample
#+BEGIN_SRC
while (1) { date; sleep 3 }
#+END_SRC
*** ruby
** for what?
* security
** layer
*** tree
**** cisco
*** leaf
* operating system
** kinds of
*** linux
*** kali
*** debian
*** android
o** windows
*** registry
**** at

- https://msdn.microsoft.com/en-us/library/ms724877%28v=vs.85%29.aspx

**** with

- reg, regedit

*** windows
** deep
*** process
*** file system
** lots of
*** capistrano
* shell
** t-shell
*** semi agent
** agent
*** do as what x do? or did? or will do as what y want!
* infra
** email fly
** proxy
** spof
** tree
** amazon
*** ec2
** monitoring, knowing
*** nagios
*** mon
* malware
** pentesting tool

- Exploit pack
- Metasploit, Armitage(GUI)

** exploit kit
*** Angler
*** Neutrino
** DONE ransomware

http://www.rancert.com/prevent.php
http://www.ahnlab.com/kr/site/securityinfo/ransomware/index.do

*** Locky

- by email, attachment file using office macro then javascript 
- drive-by-download, Neutrino EK
- tail : .locky
- _Locky_recover_instructions.txt
- Command: vssadmin.exe Delete Shadows /All /Quiet

*** TeslaCrypt 3.0

- tail : .mp3
- RECOVERRmhwqb.txt

*** CryptoWall

- tail : .vvv

*** Linux.Encoder.1 / Dr. Web

- tail : .encrypted
- [[https://labs.bitdefender.com/2015/11/linux-ransomware-debut-fails-on-predictable-encryption-key/][No need to crack RSA when you can guess the key]]

*** dig
