index.html
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> slime</h3>
</div>
<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> tramp</h3>
</div>
<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> ace-swap-window</h3>
</div>
<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> one more on emacs</h3>
<div class="outline-text-3" id="text-6-6">
</div><div id="outline-container-sec-6-6-1" class="outline-4">
<h4 id="sec-6-6-1"><span class="section-number-4">6.6.1</span> remove CR</h4>
<div class="outline-text-4" id="text-6-6-1">
<ul class="org-ul">
<li>M-x delete-trailing-whitespace
</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> hardware</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> serial</h3>
</div>
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> modem</h3>
</div>
<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> usb</h3>
<div class="outline-text-3" id="text-7-3">
</div><div id="outline-container-sec-7-3-1" class="outline-4">
<h4 id="sec-7-3-1"><span class="section-number-4">7.3.1</span> usb2serial</h4>
</div>
<div id="outline-container-sec-7-3-2" class="outline-4">
<h4 id="sec-7-3-2"><span class="section-number-4">7.3.2</span> host</h4>
</div>
<div id="outline-container-sec-7-3-3" class="outline-4">
<h4 id="sec-7-3-3"><span class="section-number-4">7.3.3</span> nic</h4>
<div class="outline-text-4" id="text-7-3-3">
</div><ol class="org-ol"><li><a id="sec-7-3-3-1" name="sec-7-3-3-1"></a>rndis<br  /></li>
<li><a id="sec-7-3-3-2" name="sec-7-3-3-2"></a>CDC-ECM<br  /></li></ol>
</div>
</div>
<div id="outline-container-sec-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> bios?</h3>
</div>
<div id="outline-container-sec-7-5" class="outline-3">
<h3 id="sec-7-5"><span class="section-number-3">7.5</span> memory</h3>
</div>
<div id="outline-container-sec-7-6" class="outline-3">
<h3 id="sec-7-6"><span class="section-number-3">7.6</span> cpu</h3>
</div>
<div id="outline-container-sec-7-7" class="outline-3">
<h3 id="sec-7-7"><span class="section-number-3">7.7</span> disk, storage</h3>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> programming</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> lisp on emacs or clisp</h3>
<div class="outline-text-3" id="text-8-1">
</div><div id="outline-container-sec-8-1-1" class="outline-4">
<h4 id="sec-8-1-1"><span class="section-number-4">8.1.1</span> list</h4>
</div>
<div id="outline-container-sec-8-1-2" class="outline-4">
<h4 id="sec-8-1-2"><span class="section-number-4">8.1.2</span> when?</h4>
</div>
<div id="outline-container-sec-8-1-3" class="outline-4">
<h4 id="sec-8-1-3"><span class="section-number-4">8.1.3</span> sample</h4>
<div class="outline-text-4" id="text-8-1-3">
<pre class="example">
(cons t nil)
(if 1 2 3)
(when 1 2 3)
(cond (1 2) (3 4))
(loop for i from 1 to 10 collect i)
(defun foo () (format t "this is foo"))
(random 10)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> perl or shell script(bash or more)</h3>
<div class="outline-text-3" id="text-8-2">
</div><div id="outline-container-sec-8-2-1" class="outline-4">
<h4 id="sec-8-2-1"><span class="section-number-4">8.2.1</span> string</h4>
</div>
<div id="outline-container-sec-8-2-2" class="outline-4">
<h4 id="sec-8-2-2"><span class="section-number-4">8.2.2</span> cpan</h4>
</div>
<div id="outline-container-sec-8-2-3" class="outline-4">
<h4 id="sec-8-2-3"><span class="section-number-4">8.2.3</span> sample</h4>
<div class="outline-text-4" id="text-8-2-3">
<pre class="example">
foreach $line (&lt;&gt;) {
  $line ~= s/\r//g;
  $line ~= s/\n//g;
  print $line . "\n";q
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> what else?</h3>
<div class="outline-text-3" id="text-8-3">
</div><div id="outline-container-sec-8-3-1" class="outline-4">
<h4 id="sec-8-3-1"><span class="section-number-4">8.3.1</span> powershell</h4>
<div class="outline-text-4" id="text-8-3-1">
</div><ol class="org-ol"><li><a id="sec-8-3-1-1" name="sec-8-3-1-1"></a>sample<br  /><div class="outline-text-5" id="text-8-3-1-1">
<pre class="example">
while (1) { date; sleep 3 }
</pre>
</div>
</li></ol>
</div>
<div id="outline-container-sec-8-3-2" class="outline-4">
<h4 id="sec-8-3-2"><span class="section-number-4">8.3.2</span> ruby</h4>
</div>
</div>
<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> for what?</h3>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> security</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> layer</h3>
<div class="outline-text-3" id="text-9-1">
</div><div id="outline-container-sec-9-1-1" class="outline-4">
<h4 id="sec-9-1-1"><span class="section-number-4">9.1.1</span> tree</h4>
<div class="outline-text-4" id="text-9-1-1">
</div><ol class="org-ol"><li><a id="sec-9-1-1-1" name="sec-9-1-1-1"></a>cisco<br  /></li></ol>
</div>
<div id="outline-container-sec-9-1-2" class="outline-4">
<h4 id="sec-9-1-2"><span class="section-number-4">9.1.2</span> leaf</h4>
</div>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> operating system</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> kinds of</h3>
<div class="outline-text-3" id="text-10-1">
</div><div id="outline-container-sec-10-1-1" class="outline-4">
<h4 id="sec-10-1-1"><span class="section-number-4">10.1.1</span> linux</h4>
</div>
<div id="outline-container-sec-10-1-2" class="outline-4">
<h4 id="sec-10-1-2"><span class="section-number-4">10.1.2</span> kali</h4>
</div>
<div id="outline-container-sec-10-1-3" class="outline-4">
<h4 id="sec-10-1-3"><span class="section-number-4">10.1.3</span> debian</h4>
</div>
<div id="outline-container-sec-10-1-4" class="outline-4">
<h4 id="sec-10-1-4"><span class="section-number-4">10.1.4</span> android</h4>
<div class="outline-text-4" id="text-10-1-4">
<p>
o** windows
</p>
</div>
</div>
<div id="outline-container-sec-10-1-5" class="outline-4">
<h4 id="sec-10-1-5"><span class="section-number-4">10.1.5</span> registry</h4>
<div class="outline-text-4" id="text-10-1-5">
</div><ol class="org-ol"><li><a id="sec-10-1-5-1" name="sec-10-1-5-1"></a>at<br  /><div class="outline-text-5" id="text-10-1-5-1">
<ul class="org-ul">
<li><a href="https://msdn.microsoft.com/en-us/library/ms724877(v=vs.85).aspx">https://msdn.microsoft.com/en-us/library/ms724877(v=vs.85).aspx</a>
</li>
</ul>
</div>
</li>

<li><a id="sec-10-1-5-2" name="sec-10-1-5-2"></a>with<br  /><div class="outline-text-5" id="text-10-1-5-2">
<ul class="org-ul">
<li>reg, regedit
</li>
</ul>
</div>
</li></ol>
</div>

<div id="outline-container-sec-10-1-6" class="outline-4">
<h4 id="sec-10-1-6"><span class="section-number-4">10.1.6</span> windows</h4>
</div>
</div>
<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> deep</h3>
<div class="outline-text-3" id="text-10-2">
</div><div id="outline-container-sec-10-2-1" class="outline-4">
<h4 id="sec-10-2-1"><span class="section-number-4">10.2.1</span> process</h4>
</div>
<div id="outline-container-sec-10-2-2" class="outline-4">
<h4 id="sec-10-2-2"><span class="section-number-4">10.2.2</span> file system</h4>
</div>
</div>
<div id="outline-container-sec-10-3" class="outline-3">
<h3 id="sec-10-3"><span class="section-number-3">10.3</span> lots of</h3>
<div class="outline-text-3" id="text-10-3">
</div><div id="outline-container-sec-10-3-1" class="outline-4">
<h4 id="sec-10-3-1"><span class="section-number-4">10.3.1</span> capistrano</h4>
</div>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> shell</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> t-shell</h3>
<div class="outline-text-3" id="text-11-1">
</div><div id="outline-container-sec-11-1-1" class="outline-4">
<h4 id="sec-11-1-1"><span class="section-number-4">11.1.1</span> semi agent</h4>
</div>
</div>
<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> agent</h3>
<div class="outline-text-3" id="text-11-2">
</div><div id="outline-container-sec-11-2-1" class="outline-4">
<h4 id="sec-11-2-1"><span class="section-number-4">11.2.1</span> do as what x do? or did? or will do as what y want!</h4>
</div>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> infra</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> email fly</h3>
</div>
<div id="outline-container-sec-12-2" class="outline-3">
<h3 id="sec-12-2"><span class="section-number-3">12.2</span> proxy</h3>
</div>
<div id="outline-container-sec-12-3" class="outline-3">
<h3 id="sec-12-3"><span class="section-number-3">12.3</span> spof</h3>
</div>
<div id="outline-container-sec-12-4" class="outline-3">
<h3 id="sec-12-4"><span class="section-number-3">12.4</span> tree</h3>
</div>
<div id="outline-container-sec-12-5" class="outline-3">
<h3 id="sec-12-5"><span class="section-number-3">12.5</span> amazon</h3>
<div class="outline-text-3" id="text-12-5">
</div><div id="outline-container-sec-12-5-1" class="outline-4">
<h4 id="sec-12-5-1"><span class="section-number-4">12.5.1</span> ec2</h4>
</div>
</div>
<div id="outline-container-sec-12-6" class="outline-3">
<h3 id="sec-12-6"><span class="section-number-3">12.6</span> monitoring, knowing</h3>
<div class="outline-text-3" id="text-12-6">
</div><div id="outline-container-sec-12-6-1" class="outline-4">
<h4 id="sec-12-6-1"><span class="section-number-4">12.6.1</span> nagios</h4>
</div>
<div id="outline-container-sec-12-6-2" class="outline-4">
<h4 id="sec-12-6-2"><span class="section-number-4">12.6.2</span> mon</h4>
</div>
</div>
</div>
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> malware</h2>
<div class="outline-text-2" id="text-13">
</div><div id="outline-container-sec-13-1" class="outline-3">
<h3 id="sec-13-1"><span class="section-number-3">13.1</span> pentesting tool</h3>
<div class="outline-text-3" id="text-13-1">
<ul class="org-ul">
<li>Exploit pack
</li>
<li>Metasploit, Armitage(GUI)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-13-2" class="outline-3">
<h3 id="sec-13-2"><span class="section-number-3">13.2</span> exploit kit</h3>
<div class="outline-text-3" id="text-13-2">
</div><div id="outline-container-sec-13-2-1" class="outline-4">
<h4 id="sec-13-2-1"><span class="section-number-4">13.2.1</span> Angler</h4>
</div>
<div id="outline-container-sec-13-2-2" class="outline-4">
<h4 id="sec-13-2-2"><span class="section-number-4">13.2.2</span> Neutrino</h4>
</div>
</div>
<div id="outline-container-sec-13-3" class="outline-3">
<h3 id="sec-13-3"><span class="section-number-3">13.3</span> <span class="done DONE">DONE</span> ransomware</h3>
<div class="outline-text-3" id="text-13-3">
<p>
<a href="http://www.rancert.com/prevent.php">http://www.rancert.com/prevent.php</a>
<a href="http://www.ahnlab.com/kr/site/securityinfo/ransomware/index.do">http://www.ahnlab.com/kr/site/securityinfo/ransomware/index.do</a>
</p>
</div>

<div id="outline-container-sec-13-3-1" class="outline-4">
<h4 id="sec-13-3-1"><span class="section-number-4">13.3.1</span> Locky</h4>
<div class="outline-text-4" id="text-13-3-1">
<ul class="org-ul">
<li>by email, attachment file using office macro then javascript 
</li>
<li>drive-by-download, Neutrino EK
</li>
<li>tail : .locky
</li>
<li>_Locky<sub>recover</sub><sub>instructions</sub>.txt
</li>
<li>Command: vssadmin.exe Delete Shadows /All /Quiet
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-13-3-2" class="outline-4">
<h4 id="sec-13-3-2"><span class="section-number-4">13.3.2</span> TeslaCrypt 3.0</h4>
<div class="outline-text-4" id="text-13-3-2">
<ul class="org-ul">
<li>tail : .mp3
</li>
<li>RECOVERRmhwqb.txt
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-13-3-3" class="outline-4">
<h4 id="sec-13-3-3"><span class="section-number-4">13.3.3</span> CryptoWall</h4>
<div class="outline-text-4" id="text-13-3-3">
<ul class="org-ul">
<li>tail : .vvv
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-13-3-4" class="outline-4">
<h4 id="sec-13-3-4"><span class="section-number-4">13.3.4</span> Linux.Encoder.1 / Dr. Web</h4>
<div class="outline-text-4" id="text-13-3-4">
<ul class="org-ul">
<li>tail : .encrypted
</li>
<li><a href="https://labs.bitdefender.com/2015/11/linux-ransomware-debut-fails-on-predictable-encryption-key/">No need to crack RSA when you can guess the key</a>
</li>
</ul>
</div>
</div>
