index.org
**** office macro
**** pdf

- adobe specific javascript API

**** javascript

- obfuscation

**** ransomware

***** shellcode do something

***** care shadow copy

- wmic shadowcopy delete
- vssadmin delete shadows /all /quiet

**** sdelete

- delete key file

**** GnuPG

- encryption

** windows script host, wsh, jscript, vbs

http://www.thewindowsclub.com/windows-script-host-access-is-disabled-on-this-machine

#+BEGIN_SRC

C:\>reg query "HKLM\Software\Microsoft\Windows Script Host\Settings"

HKEY_LOCAL_MACHINE\Software\Microsoft\Windows Script Host\Settings
    DisplayLogo    REG_SZ    1
    ActiveDebugging    REG_SZ    1
    SilentTerminate    REG_SZ    0
    UseWINSAFER    REG_SZ    1

C:\tmp>REG ADD "HKLM\Software\Microsoft\Windows Script Host\Settings" /v Enabled /t REG_SZ /d 0

C:\Users\see>reg query "HKLM\Software\Microsoft\Windows Script Host\Settings" | findstr Enabled
    Enabled    REG_SZ    0

C:\tmp>cscript foo.vbs
Windows Script Host access is disabled on this machine. Contact your administrator for details.

#+END_SRC

** policy, whilte
** vaccine
*** v3
*** Windows Defender for Windows 10 and Windows 8.1
*** Microsoft Security Essentials for Windows7 and Windows Vista
*** Microsoft Safety Scanner, just one time
** defense
*** Shadow Volume Copies then ShadowExplorer
*** Backup
*** inotify

- Linux Malware Detect

** packer, unpacker, compressor, obfuscation
** tool
*** gmer
*** pestudio
*** virustotal
*** officecat
*** offvis
*** http://jsbeautifier.org/
*** sigcheck -v

- using virustotal

*** sysinternals
* memo
** moleskine
** share
* cinema
** why?
** list and lots of
* compute
** not computer
** robot
** HAL, 2001
* key tech
** for free, for free
- telegram messenger
- TLS, Transport Layer Security
** for money
*** ransomware, cryptoware
- Tip of the week: How to protect yourself from cryptoware
* network
** router
*** BGP
** switch
** trunk, etherchannel, bonding
* versioning
** git
*** github
** svn, cvs
* configration management
*** puppet
*** cfengine
* reversing
*** reversing.kr
*** ALZ
*** vs locky ransomware

- http://heavyrainslab.tistory.com/87
- http://blog.naver.com/PostView.nhn?blogId=koromoon&logNo=220603850410&categoryNo=0&parentCategoryNo=37&viewDate=&currentPage=1&postListTopCurrentPage=1&from=postView
* robot

* up2date

- java
- adobe flash
- hangul
- windows
- vaccine

* backup

* digital forensics
*** ls -ltr
*** FTK
*** lots of more

- Top 20 Free Digital Forensic Investigation Tools for SysAdmins
* v3 Process Listing

