index.html

<div id="outline-container-sec-13-3-5" class="outline-4">
<h4 id="sec-13-3-5"><span class="section-number-4">13.3.5</span> dig</h4>
<div class="outline-text-4" id="text-13-3-5">
</div><ol class="org-ol"><li><a id="sec-13-3-5-1" name="sec-13-3-5-1"></a>office macro<br  /></li>
<li><a id="sec-13-3-5-2" name="sec-13-3-5-2"></a>pdf<br  /><div class="outline-text-5" id="text-13-3-5-2">
<ul class="org-ul">
<li>adobe specific javascript API
</li>
</ul>
</div>
</li>

<li><a id="sec-13-3-5-3" name="sec-13-3-5-3"></a>javascript<br  /><div class="outline-text-5" id="text-13-3-5-3">
<ul class="org-ul">
<li>obfuscation
</li>
</ul>
</div>
</li>

<li><a id="sec-13-3-5-4" name="sec-13-3-5-4"></a>ransomware<br  /><ol class="org-ol"><li><a id="sec-13-3-5-4-1" name="sec-13-3-5-4-1"></a>shellcode do something<br  /></li>

<li><a id="sec-13-3-5-4-2" name="sec-13-3-5-4-2"></a>care shadow copy<br  /><div class="outline-text-6" id="text-13-3-5-4-2">
<ul class="org-ul">
<li>wmic shadowcopy delete
</li>
<li>vssadmin delete shadows /all /quiet
</li>
</ul>
</div>
</li></ol>
</li>

<li><a id="sec-13-3-5-5" name="sec-13-3-5-5"></a>sdelete<br  /><div class="outline-text-5" id="text-13-3-5-5">
<ul class="org-ul">
<li>delete key file
</li>
</ul>
</div>
</li>

<li><a id="sec-13-3-5-6" name="sec-13-3-5-6"></a>GnuPG<br  /><div class="outline-text-5" id="text-13-3-5-6">
<ul class="org-ul">
<li>encryption
</li>
</ul>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-13-4" class="outline-3">
<h3 id="sec-13-4"><span class="section-number-3">13.4</span> windows script host, wsh, jscript, vbs</h3>
<div class="outline-text-3" id="text-13-4">
<p>
<a href="http://www.thewindowsclub.com/windows-script-host-access-is-disabled-on-this-machine">http://www.thewindowsclub.com/windows-script-host-access-is-disabled-on-this-machine</a>
</p>

<pre class="example">
C:\&gt;reg query "HKLM\Software\Microsoft\Windows Script Host\Settings"

HKEY_LOCAL_MACHINE\Software\Microsoft\Windows Script Host\Settings
    DisplayLogo    REG_SZ    1
    ActiveDebugging    REG_SZ    1
    SilentTerminate    REG_SZ    0
    UseWINSAFER    REG_SZ    1

C:\tmp&gt;REG ADD "HKLM\Software\Microsoft\Windows Script Host\Settings" /v Enabled /t REG_SZ /d 0

C:\Users\see&gt;reg query "HKLM\Software\Microsoft\Windows Script Host\Settings" | findstr Enabled
    Enabled    REG_SZ    0

C:\tmp&gt;cscript foo.vbs
Windows Script Host access is disabled on this machine. Contact your administrator for details.
</pre>
</div>
</div>

<div id="outline-container-sec-13-5" class="outline-3">
<h3 id="sec-13-5"><span class="section-number-3">13.5</span> policy, whilte</h3>
</div>
<div id="outline-container-sec-13-6" class="outline-3">
<h3 id="sec-13-6"><span class="section-number-3">13.6</span> vaccine</h3>
<div class="outline-text-3" id="text-13-6">
</div><div id="outline-container-sec-13-6-1" class="outline-4">
<h4 id="sec-13-6-1"><span class="section-number-4">13.6.1</span> v3</h4>
</div>
<div id="outline-container-sec-13-6-2" class="outline-4">
<h4 id="sec-13-6-2"><span class="section-number-4">13.6.2</span> Windows Defender for Windows 10 and Windows 8.1</h4>
</div>
<div id="outline-container-sec-13-6-3" class="outline-4">
<h4 id="sec-13-6-3"><span class="section-number-4">13.6.3</span> Microsoft Security Essentials for Windows7 and Windows Vista</h4>
</div>
<div id="outline-container-sec-13-6-4" class="outline-4">
<h4 id="sec-13-6-4"><span class="section-number-4">13.6.4</span> Microsoft Safety Scanner, just one time</h4>
</div>
</div>
<div id="outline-container-sec-13-7" class="outline-3">
<h3 id="sec-13-7"><span class="section-number-3">13.7</span> defense</h3>
<div class="outline-text-3" id="text-13-7">
</div><div id="outline-container-sec-13-7-1" class="outline-4">
<h4 id="sec-13-7-1"><span class="section-number-4">13.7.1</span> Shadow Volume Copies then ShadowExplorer</h4>
</div>
<div id="outline-container-sec-13-7-2" class="outline-4">
<h4 id="sec-13-7-2"><span class="section-number-4">13.7.2</span> Backup</h4>
</div>
<div id="outline-container-sec-13-7-3" class="outline-4">
<h4 id="sec-13-7-3"><span class="section-number-4">13.7.3</span> inotify</h4>
<div class="outline-text-4" id="text-13-7-3">
<ul class="org-ul">
<li>Linux Malware Detect
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-13-8" class="outline-3">
<h3 id="sec-13-8"><span class="section-number-3">13.8</span> packer, unpacker, compressor, obfuscation</h3>
</div>
<div id="outline-container-sec-13-9" class="outline-3">
<h3 id="sec-13-9"><span class="section-number-3">13.9</span> tool</h3>
<div class="outline-text-3" id="text-13-9">
</div><div id="outline-container-sec-13-9-1" class="outline-4">
<h4 id="sec-13-9-1"><span class="section-number-4">13.9.1</span> gmer</h4>
</div>
<div id="outline-container-sec-13-9-2" class="outline-4">
<h4 id="sec-13-9-2"><span class="section-number-4">13.9.2</span> pestudio</h4>
</div>
<div id="outline-container-sec-13-9-3" class="outline-4">
<h4 id="sec-13-9-3"><span class="section-number-4">13.9.3</span> virustotal</h4>
</div>
<div id="outline-container-sec-13-9-4" class="outline-4">
<h4 id="sec-13-9-4"><span class="section-number-4">13.9.4</span> officecat</h4>
</div>
<div id="outline-container-sec-13-9-5" class="outline-4">
<h4 id="sec-13-9-5"><span class="section-number-4">13.9.5</span> offvis</h4>
</div>
<div id="outline-container-sec-13-9-6" class="outline-4">
<h4 id="sec-13-9-6"><span class="section-number-4">13.9.6</span> <a href="http://jsbeautifier.org/">http://jsbeautifier.org/</a></h4>
</div>
<div id="outline-container-sec-13-9-7" class="outline-4">
<h4 id="sec-13-9-7"><span class="section-number-4">13.9.7</span> sigcheck -v</h4>
<div class="outline-text-4" id="text-13-9-7">
<ul class="org-ul">
<li>using virustotal
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-13-9-8" class="outline-4">
<h4 id="sec-13-9-8"><span class="section-number-4">13.9.8</span> sysinternals</h4>
</div>
</div>
</div>
<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> memo</h2>
<div class="outline-text-2" id="text-14">
</div><div id="outline-container-sec-14-1" class="outline-3">
<h3 id="sec-14-1"><span class="section-number-3">14.1</span> moleskine</h3>
</div>
<div id="outline-container-sec-14-2" class="outline-3">
<h3 id="sec-14-2"><span class="section-number-3">14.2</span> share</h3>
</div>
</div>
<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> cinema</h2>
<div class="outline-text-2" id="text-15">
</div><div id="outline-container-sec-15-1" class="outline-3">
<h3 id="sec-15-1"><span class="section-number-3">15.1</span> why?</h3>
</div>
<div id="outline-container-sec-15-2" class="outline-3">
<h3 id="sec-15-2"><span class="section-number-3">15.2</span> list and lots of</h3>
</div>
</div>
<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> compute</h2>
<div class="outline-text-2" id="text-16">
</div><div id="outline-container-sec-16-1" class="outline-3">
<h3 id="sec-16-1"><span class="section-number-3">16.1</span> not computer</h3>
</div>
<div id="outline-container-sec-16-2" class="outline-3">
<h3 id="sec-16-2"><span class="section-number-3">16.2</span> robot</h3>
</div>
<div id="outline-container-sec-16-3" class="outline-3">
<h3 id="sec-16-3"><span class="section-number-3">16.3</span> HAL, 2001</h3>
</div>
</div>
<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> key tech</h2>
<div class="outline-text-2" id="text-17">
</div><div id="outline-container-sec-17-1" class="outline-3">
<h3 id="sec-17-1"><span class="section-number-3">17.1</span> for free, for free</h3>
<div class="outline-text-3" id="text-17-1">
<ul class="org-ul">
<li>telegram messenger
</li>
<li>TLS, Transport Layer Security
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-17-2" class="outline-3">
<h3 id="sec-17-2"><span class="section-number-3">17.2</span> for money</h3>
<div class="outline-text-3" id="text-17-2">
</div><div id="outline-container-sec-17-2-1" class="outline-4">
<h4 id="sec-17-2-1"><span class="section-number-4">17.2.1</span> ransomware, cryptoware</h4>
<div class="outline-text-4" id="text-17-2-1">
<ul class="org-ul">
<li>Tip of the week: How to protect yourself from cryptoware
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> network</h2>
<div class="outline-text-2" id="text-18">
</div><div id="outline-container-sec-18-1" class="outline-3">
<h3 id="sec-18-1"><span class="section-number-3">18.1</span> router</h3>
<div class="outline-text-3" id="text-18-1">
</div><div id="outline-container-sec-18-1-1" class="outline-4">
<h4 id="sec-18-1-1"><span class="section-number-4">18.1.1</span> BGP</h4>
</div>
</div>
<div id="outline-container-sec-18-2" class="outline-3">
<h3 id="sec-18-2"><span class="section-number-3">18.2</span> switch</h3>
</div>
<div id="outline-container-sec-18-3" class="outline-3">
<h3 id="sec-18-3"><span class="section-number-3">18.3</span> trunk, etherchannel, bonding</h3>
</div>
</div>
<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> versioning</h2>
<div class="outline-text-2" id="text-19">
</div><div id="outline-container-sec-19-1" class="outline-3">
<h3 id="sec-19-1"><span class="section-number-3">19.1</span> git</h3>
<div class="outline-text-3" id="text-19-1">
</div><div id="outline-container-sec-19-1-1" class="outline-4">
<h4 id="sec-19-1-1"><span class="section-number-4">19.1.1</span> github</h4>
</div>
</div>
<div id="outline-container-sec-19-2" class="outline-3">
<h3 id="sec-19-2"><span class="section-number-3">19.2</span> svn, cvs</h3>
</div>
</div>
<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> configration management</h2>
<div class="outline-text-2" id="text-20">
</div><div id="outline-container-sec-20-0-1" class="outline-4">
<h4 id="sec-20-0-1"><span class="section-number-4">20.0.1</span> puppet</h4>
</div>
<div id="outline-container-sec-20-0-2" class="outline-4">
<h4 id="sec-20-0-2"><span class="section-number-4">20.0.2</span> cfengine</h4>
</div>
</div>
<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> reversing</h2>
<div class="outline-text-2" id="text-21">
</div><div id="outline-container-sec-21-0-1" class="outline-4">
<h4 id="sec-21-0-1"><span class="section-number-4">21.0.1</span> reversing.kr</h4>
</div>
<div id="outline-container-sec-21-0-2" class="outline-4">
<h4 id="sec-21-0-2"><span class="section-number-4">21.0.2</span> ALZ</h4>
</div>
<div id="outline-container-sec-21-0-3" class="outline-4">
<h4 id="sec-21-0-3"><span class="section-number-4">21.0.3</span> vs locky ransomware</h4>
<div class="outline-text-4" id="text-21-0-3">
<ul class="org-ul">
<li><a href="http://heavyrainslab.tistory.com/87">http://heavyrainslab.tistory.com/87</a>
</li>
<li><a href="http://blog.naver.com/PostView.nhn?blogId=koromoon&logNo=220603850410&categoryNo=0&parentCategoryNo=37&viewDate=&currentPage=1&postListTopCurrentPage=1&from=postView">http://blog.naver.com/PostView.nhn?blogId=koromoon&logNo=220603850410&categoryNo=0&parentCategoryNo=37&viewDate=&currentPage=1&postListTopCurrentPage=1&from=postView</a>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> robot</h2>
</div>

<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> up2date</h2>
<div class="outline-text-2" id="text-23">
<ul class="org-ul">
<li>java
</li>
<li>adobe flash
</li>
<li>hangul
</li>
<li>windows
</li>
<li>vaccine
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> backup</h2>
</div>

<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> digital forensics</h2>
<div class="outline-text-2" id="text-25">
</div><div id="outline-container-sec-25-0-1" class="outline-4">
<h4 id="sec-25-0-1"><span class="section-number-4">25.0.1</span> ls -ltr</h4>
</div>
<div id="outline-container-sec-25-0-2" class="outline-4">
<h4 id="sec-25-0-2"><span class="section-number-4">25.0.2</span> FTK</h4>
</div>
<div id="outline-container-sec-25-0-3" class="outline-4">
<h4 id="sec-25-0-3"><span class="section-number-4">25.0.3</span> lots of more</h4>
<div class="outline-text-4" id="text-25-0-3">
<ul class="org-ul">
<li>Top 20 Free Digital Forensic Investigation Tools for SysAdmins
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> v3 Process Listing</h2>
